/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "The operation could not be completed";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "An unknown error occurred (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Cannot Complete Action";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Try again later.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Cannot Record";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Try recording again.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Cannot Record";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Stop any other actions using the %@ and try again."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Cannot Record";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Try recording again.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Recording Stopped";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Try recording again.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Operation Stopped";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "There is not enough available space to continue the file writing. Make room by deleting existing videos or photos.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Recording Stopped";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Try recording again.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Recording Stopped";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Try recording again.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Recording Stopped";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "The recording reached the maximum allowable length."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Recording Stopped";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "The recording reached the maximum allowable file size."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Recording Stopped";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Stop any other actions using the recording device and try again.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Recording Stopped";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "The recording reached the maximum allowable length."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Cannot Record";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Try recording again.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "Cannot Use %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Stop any other actions using the %@ and try again."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "Cannot Use %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Stop any other actions using the %@ and try again."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Recording Stopped";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Stop any other actions using the recording device and try again.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_Description" = "The torch could not be turned on.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_RecoverySuggestion" = "Try turning the torch on at a lower level.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Cannot Complete Action";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Try again later.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Cannot Complete Export";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Try exporting again.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Cannot Decode";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "The media data could not be decoded. It may be damaged.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "This media format is not supported.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Cannot Save";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Try saving again.";

"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_Description" = "Cannot write output file";
"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_RecoverySuggestion" = "Change the output extension and try again.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "This media cannot be used.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "This media cannot be used.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "This media cannot be used.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "This media cannot be used.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "This media format is not supported.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "This media may be damaged.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Cannot Take Photo";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Try taking a photo again.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Operation Stopped";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "The operation is not supported for protected content."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "This content is not authorised."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "This app is not authorised to play this file."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "This media cannot be used.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Cannot Decode";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "The decoder required for this media cannot be found.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Cannot Encode";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "The encoder required for this media cannot be found.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Cannot Decode";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "The decoder required for this media is busy.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Stop any other actions that decode media and try again.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Cannot Encode";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "The encoder required for this media is busy.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Stop any other actions that encode media and try again.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "Cannot Use %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "%@ may not be used by an app running in the background."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Operation Stopped";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "The operation is not supported for this media.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Operation Stopped";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "The video could not be composed according to the supplied instructions.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "This media cannot be used.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Operation Stopped";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "The cache file at the download destination URL cannot be used.";

"AVFoundationErrorDomain_AVErrorFileChecksumFailed_Description" = "Operation Stopped";
"AVFoundationErrorDomain_AVErrorFileChecksumFailed_FailureReason" = "The file has an invalid checksum.";

"AVFoundationErrorDomain_AVErrorOperationInterrupted_Description" = "Operation Interrupted";
"AVFoundationErrorDomain_AVErrorOperationInterrupted_RecoverySuggestion" = "Stop other operations and try again.";

"AVFoundationErrorDomain_AVErrorIncompatibleAsset_Description" = "Cannot Open";
"AVFoundationErrorDomain_AVErrorIncompatibleAsset_FailureReason" = "The media cannot be used on this device.";

"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_Description" = "Operation Stopped";
"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_FailureReason" = "This media may be damaged.";

"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_Description" = "Operation Stopped";
"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_FailureReason" = "The server is not correctly configured.";
